{
  "nav": {
    "about": "About",
    "career": "Career",
    "projects": "Projects",
    "education": "Education",
    "certificates": "Certificates"
  },
  "about": {
    "title": "About",
    "greeting": "Hello, I'm Aytaç Serçe.",
    "about_me": "I'm a Frontend Engineer passionate about building fast, accessible, and elegant web applications using React, Next.js, and Tailwind CSS.",
    "graduation": "I hold a degree in engineering and bring strong analytical thinking and problem-solving skills into every project I work on.",
    "work_experience": "Earlier in my career, I served as an officer and instructor, where I developed discipline, leadership, and attention to detail — qualities that now help me write clean code, plan projects effectively, and collaborate well within teams.",
    "scholarship": "I also had the opportunity to study in the U.S. through a scholarship program, which expanded my global perspective and adaptability.",
    "current_position": "I’m currently based in Istanbul, working as a Frontend Engineer on freelance and full-time projects, creating user-focused and high-performance interfaces.",
    "portfolio": "This website is my personal portfolio, built with Next.js and Tailwind CSS.",
    "family": "I’m married with two children.",
    "update": "Last Update: October 2025",
    "download_resume": "Download Resume"
  },
  "career": {
    "title": "Career",
    "zebra": "Zebra Electronics",
    "english_teacher": "English Teacher",
    "english": "American Lang. and Lit. Foreign Lang. Schools",
    "officer": "Officer / Instructor",
    "nat_def_unv": "National Defence University",
    "zebra_desc": "Maintained and enhanced two enterprise web applications built with Angular and TypeScript, adding new modules and improving existing functionality.\nDeveloped an admin dashboard using React and Material UI.\nImplemented performance optimizations and responsive layouts to improve user experience across devices.",
    "freelance_desc": "Designed and developed responsive websites for organic farming, construction, and sportswear industries.\nBuilt modern, SEO-friendly interfaces using Next.js, Tailwind CSS, and JavaScript.\nCustomized UI/UX designs and integrated content management systems according to client needs.",
    "english_desc": "Started as an instructor and was promoted to Coordinator within five months.\nCreated teaching materials and contributed to the digitalization of lesson plans.\nStrengthened my communication, presentation, and organization skills.",
    "nat_def_unv_desc": "Began as a trainee and graduated top of class, later appointed as an instructor.\nGained strong skills in leadership, planning, and problem-solving under demanding conditions.\nTaught avionics courses to hundreds of trainees, including international participants.\nParticipated in a new aircraft project, contributing to UI/UX design and avionics test development."
  },
  "education": {
    "title": "Education",
    "anatolia": "Anatolian Unv",
    "patika": "Patika.dev",
    "self": "Self-Taught Learning",
    "nat_def_unv": "National Defence University",
    "anatolia_detail": "Bachelor’s Degree – Management Information Systems",
    "patika_detail": "Angular Practicum & Bootcamp Acceleration Program",
    "self_detail": "Frontend Development Track",
    "nat_def_unv_detail": "Bachelor’s Degree – Electronics Engineering",
    "anatolia_desc": "Studying the intersection of business processes and information technologies.\nFocused on data analysis, information systems management, and digital transformation.",
    "patika_desc": "Gained hands-on experience building modern web applications using Angular, TypeScript, and RESTful APIs.\nCollaborated in team-based projects with a focus on code reviews, version control, and project planning.",
    "self_desc": "Responsive Web Design (HTML & CSS)\nJavaScript Expert\nAdvanced CSS & SASS\nReact & Redux\nGit – Version Control\nIntro to Java Spring\nApplied theoretical knowledge by building real-world web apps during self-learning.",
    "nat_def_unv_desc": "Studied circuit design, signal processing, and system integration.\nDeveloped strong analytical thinking, attention to detail, and structured problem-solving abilities."
  },
  "certificates": {
    "title": "Certificates",
    "view-certificate": "View Certificate",
    "html-css-course": "Build Responsive Real-World Web Sites with HTML and CSS",
    "sass-course": "Advanced CSS and Sass",
    "javascript-course": "The Complete JavaScript Course",
    "react-course": "The Ultimate React Course: React, Next.js, Redux",
    "node-course": "Node.js, Express, MongoDB",
    "java-course": "Core Java, Java OOP and Spring",
    "patika-angular-practicum": " Patika.dev Angular Practicum",
    "html-course": "Web Development with HTML5",
    "website-course": "Website Usability",
    "git-course": "Version Control with Git and Github",
    "btk-react-course": "Web Programming with React",
    "safety-course": "International Flight Safety Officer Course",
    "english": "YDS Exam Result"
  },
  "projects": {
    "title": "Projects",
    "screenshots": "Screenshots",
    "view-project": "View Project",
    "private-project": "Private Project",
    "city_hotel": "The City Hotel",
    "city_hotel_desc": "A full-stack booking platform engineered with Next.js and Firebase. Implemented secure Google authentication (NextAuth) and complex Firestore security rules to manage user-specific reservations while keeping room data read-only. Integrated Contentful Headless CMS to dynamically drive the 'About' page content, allowing for real-time updates without code deployment.",
    "project_1": "Construction Approval System",
    "project_1_desc": "An enterprise-level web app for a construction company. Includes complex multi-tab forms (~100 fields), calculations for structural metrics, dynamic charts, and automated PDF report generation for government approval. Built using React, Redux, Material UI, and Tailwind. The backend only stores project data; all computations and PDF generation are handled on the frontend.",
    "project_2": "EV Charging Management Platform",
    "project_2_desc": "A complete suite of web apps for electric vehicle charging management, including Admin, Customer (CMP), and Station Management (CSMS) portals. Developed and maintained across React and Angular frameworks with Redux, Bootstrap, Firebase, and WebSocket integration. Built real-time dashboards, live log terminal, firmware update panel, invoicing, and analytics modules. Integrated with hundreds of backend endpoints generated via Swagger from Java APIs.",
    "project_3": "Nature Balance Guide",
    "project_3_desc": "An informational website about ecological balance and sustainability.",
    "project_4": "WBOC Sports",
    "project_4_desc": "A promotional website for a custom sportswear brand, featuring product catalogs and a contact form."
  },
  "footer": {
    "copyright": "© {{year}} Aytac Serce"
  }
}
