{
  "nav": {
    "about": "Hakkımda",
    "career": "Kariyer",
    "projects": "Projeler",
    "education": "Eğitim",
    "certificates": "Sertifikalar"
  },
  "about": {
    "title": "Hakkımda",
    "greeting": "Merhaba, ben Aytaç Serçe.",
    "about_me": "Frontend Mühendisi olarak React, Next.js, Angular ve Tailwind CSS teknolojileriyle modern, performanslı ve kullanıcı dostu web uygulamaları geliştiriyorum.",
    "graduation": "Üniversitede mühendislik eğitimi aldım ve hem teknik disiplin hem analitik düşünme becerilerimi frontend geliştirme alanına taşıdım.",
    "work_experience": "Kariyerimin ilk yıllarında subay ve eğitmen olarak görev yaparken planlama, takım çalışması ve detay odaklılık konularında güçlü bir temel kazandım. Bu beceriler bugün kod yazarken, tasarımları optimize ederken ve kullanıcı deneyimini geliştirirken bana büyük avantaj sağlıyor.",
    "scholarship": "ABD’de güvenlik kursu bursu kazanmam sayesinde uluslararası bir çevrede disiplinli ve çözüm odaklı çalışma alışkanlığı edindim.",
    "current_position": "Şu anda İstanbul’da yaşıyorum ve freelance veya tam zamanlı projelerde Frontend Mühendisi olarak çalışıyorum.",
    "portfolio": "Bu portföy sitesini Next.js ve Tailwind CSS kullanarak geliştirdim.",
    "family": "Evli ve iki çocuk babasıyım.",
    "update": "Son Güncelleme: Ekim 2025"
  },
  "career": {
    "title": "Kariyer",
    "zebra": "Zebra Elektronik",
    "english_teacher": "İngilizce Öğretmeni",
    "english": "Amerikan Dili ve Edebiyatı Yabancı Dil Okulları",
    "officer": "Subay / Eğitmen",
    "nat_def_unv": "Milli Savunma Üniversitesi",
    "zebra_desc": "Angular ve TypeScript kullanarak geliştirilen iki kurumsal web uygulamasının bakımını ve yeni modüllerinin eklenmesini sağladım.\nReact ve Material UI ile şirket içi bir yönetim paneli geliştirdim.\nKullanıcı deneyimini iyileştirmek için performans optimizasyonları ve responsive tasarım düzenlemeleri yaptım.",
    "freelance_desc": "Organik tarım, inşaat ve spor giyim sektörlerine ait web siteleri geliştirdim.\nNext.js, Tailwind CSS ve JavaScript kullanarak modern, hızlı ve SEO dostu arayüzler oluşturdum.\nMüşteri ihtiyaçlarına göre UI/UX düzenlemeleri ve içerik yönetimi entegrasyonları yaptım.",
    "english_desc": "Eğitmen olarak göreve başladım ve beş ay içinde koordinatörlük pozisyonuna yükseldim.\nEğitim materyalleri hazırladım ve öğretim planlarının dijitalleştirilmesine katkıda bulundum.\nBu dönemde iletişim, sunum ve organizasyon becerilerimi geliştirdim.",
    "nat_def_unv_desc": "Kariyerime kursiyer olarak başlayıp birincilikle mezun oldum ve ardından öğretmen olarak atandım.\nYoğun tempolu ortamlarda planlama, ekip yönetimi ve detay odaklı çalışma alışkanlıkları kazandım.\nYüzlerce kursiyere aviyonik dersleri verdim ve yabancı uyruklu personele eğitim verdim.\nYeni uçak projesinde UI/UX tasarımları ve aviyonik test süreçlerinde görev aldım."
  },
  "education": {
    "title": "Eğitim",
    "anatolia": "Anadolu Üniversitesi",
    "patika": "Patika.dev",
    "self": "Kendi Kendine Öğrenim",
    "nat_def_unv": "Milli Savunma Üniversitesi",
    "anatolia_detail": "Lisans – Yönetim Bilişim Sistemleri",
    "patika_detail": "Angular Practicum & Bootcamp Hızlandırma Programı",
    "self_detail": "Frontend Development Odaklı Eğitimler",
    "nat_def_unv_detail": "Lisans – Elektronik Mühendisliği",
    "anatolia_desc": "İşletme süreçleri ile bilişim teknolojilerini birleştiren kapsamlı bir eğitim programında öğrenim görüyorum.\nVeri analizi, bilgi sistemleri yönetimi ve dijital dönüşüm konularında çalışmalar yürütüyorum.",
    "patika_desc": "Angular, TypeScript ve RESTful API entegrasyonları üzerine odaklanarak modern web uygulamaları geliştirme becerileri kazandım.\nEkip tabanlı projelerde kod inceleme, versiyon kontrolü ve proje planlama deneyimi edindim.",
    "self_desc": "HTML & CSS ile Duyarlı Web Siteleri\nJavaScript Uzmanı\nİleri Seviye CSS ve SASS\nReact & Redux\nGit – Versiyon Kontrolü\nJava Spring Giriş\nBu dönemde uygulama geliştirerek teorik bilgiyi pratikle birleştirdim.",
    "nat_def_unv_desc": "Devre tasarımı, sinyal işleme ve sistem entegrasyonu konularında mühendislik eğitimi aldım.\nBu eğitim analitik düşünme, detay odaklılık ve sistematik problem çözme becerilerimi güçlendirdi."
  },
  "certificates": {
    "title": "Sertifikalar",
    "view-certificate": "Sertifika Görüntüle",
    "html-css-course": "HTML ve CSS ile Gerçek Responsive Web Siteleri Geliştirme",
    "sass-course": "İleri Seviye CSS ve Sass",
    "javascript-course": "Kapsamlı JavaScript Kursu",
    "react-course": "İleri Seviye React Kursu: React, Next.js, Redux",
    "node-course": "Node.js, Express, MongoDB",
    "java-course": "Temel Java, Java OOP ve Spring",
    "patika-angular-practicum": " Patika.dev Angular Practicum",
    "html-course": "HTML5 ile Web Geliştirme",
    "website-course": "Web Sitesi Kullanılabilirliği",
    "git-course": "Versiyon Kontrolleri: Git ve GitHub",
    "btk-react-course": "React ile Web Programcılığı",
    "safety-course": "Uluslararası Havacılık Güvenliği Eğitimi",
    "english": "YDS Sınav Sonucu"
  },
  "projects": {
    "title": "Projeler",
    "view-project": "Projeyi Görüntüle",
    "private-project": "Gizli Proje",
    "project_1": "Yapı Onay Sistemi",
    "project_1_desc": "Bir inşaat firması için kurumsal düzeyde web uygulaması. Yaklaşık 100 alan içeren çok sekmeli formlar, yapısal hesaplamalar, dinamik grafikler ve belediye onayı için otomatik PDF rapor üretimi içerir. React, Redux, Material UI ve Tailwind kullanılarak geliştirilmiştir. Backend yalnızca proje verilerini tutar, tüm hesaplamalar ve PDF işlemleri frontend tarafında yapılır.",
    "project_2": "Elektrikli Araç Şarj Yönetim Platformu",
    "project_2_desc": "Elektrikli araç şarj yönetimi için geliştirilen üç web uygulamasından oluşan kapsamlı bir platform: Yönetici Paneli, Müşteri Portalı (CMP) ve İstasyon Yönetim Sistemi (CSMS). React, Angular, Redux, Bootstrap, Firebase ve WebSocket teknolojileriyle geliştirilmiştir. Gerçek zamanlı log ekranı, yazılım güncelleme paneli, faturalandırma ve istatistik modülleri içerir. Java tabanlı backend ile Swagger üzerinden yüzlerce API entegrasyonu yapılmıştır.",
    "project_3": "Doğal Denge Rehberi",
    "project_3_desc": "Ekolojik denge ve sürdürülebilirliği ön plana alan yerel bir işletmecinin ürünlerinin sergilendiği ve satış için iletişime geçilen bir web sitesi."
  },
  "footer": {
    "copyright": "© {{year}} Aytaç Serçe"
  }
}
